### 1.1 Series的创建
#### 1）通过一维数组创建序列

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr1 = np.arange(10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
type(arr1)

numpy.ndarray

In [4]:
pd.Series(arr1)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

#### 2)通过字典的方式创建序列

In [5]:
dic = {'a':10, 'b':20, 'c':30, 'd':40, 'e':50}
pd.Series(dic)

a    10
b    20
c    30
d    40
e    50
dtype: int64

#### 3)通过DataFrame的某一行或某一列创建  

### 1.2 DataFrame的创建
#### 1)通过二维数组创建

In [6]:
arr = np.arange(12).reshape(4, 3)
pd.DataFrame(arr)

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

#### 2)通过字典的方式创建

In [7]:
dic2 = {'a':[1,2,3,4],'b':[5,6,7,8],'c':[9,10,11,12],'d':[13,14,15,16]}
dic2

{'a': [1, 2, 3, 4],
 'b': [5, 6, 7, 8],
 'c': [9, 10, 11, 12],
 'd': [13, 14, 15, 16]}

In [9]:
df1 = pd.DataFrame(dic2)
df1

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

#### 3)通过DataFrame创建

In [13]:
df2 = df1[['a', 'b']]
df2

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

### 2.数据索引Index
索引默认为从0开始的自增序列
#### 2.1 通过索引值或索引标签获取数据

In [14]:
s4 = pd.Series(np.array([1, 1, 2,3, 5, 8]))
s4

0    1
1    1
2    2
3    3
4    5
5    8
dtype: int64

In [15]:
s4.index

RangeIndex(start=0, stop=6, step=1)

In [18]:
## 修改索引
s4.index = ['a', 'b', 'c', 'd', 'e', 'f']
s4

a    1
b    1
c    2
d    3
e    5
f    8
dtype: int64

In [21]:
print(s4[3])
print(s4['e'])
print(s4[[1, 3, 5]])

3
5
b    1
d    3
f    8
dtype: int64

### 3. 数据查询

In [22]:

stu_dic = {'Age':[14,13,13,14,14,12,12,15,13,12,11,14,12,15,16,12,15,11,15],
'Height':[69,56.5,65.3,62.8,63.5,57.3,59.8,62.5,62.5,59,51.3,64.3,56.3,66.5,72,64.8,67,57.5,66.5],
'Name':['Alfred','Alice','Barbara','Carol','Henry','James','Jane','Janet','Jeffrey','John','Joyce','Judy','Louise','Marry','Philip','Robert','Ronald','Thomas','Willam'],
'Sex':['M','F','F','F','M','M','F','F','M','M','F','F','F','F','M','M','M','M','M'],
'Weight':[112.5,84,98,102.5,102.5,83,84.5,112.5,84,99.5,50.5,90,77,112,150,128,133,85,112]}
student = pd.DataFrame(stu_dic)

#### 查询前五行后五行

In [24]:
student.head()
# student.tail()

   Age  Height     Name Sex  Weight
0   14    69.0   Alfred   M   112.5
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
3   14    62.8    Carol   F   102.5
4   14    63.5    Henry   M   102.5

#### 查询指定的行
loc：匹配索引标签  
iloc：匹配索引 从0开始的非标签索引

In [25]:
student.loc[[1, 3, 5]]

   Age  Height   Name Sex  Weight
1   13    56.5  Alice   F    84.0
3   14    62.8  Carol   F   102.5
5   12    57.3  James   M    83.0

In [26]:
student.iloc[[2, 4, 6]]

   Age  Height     Name Sex  Weight
2   13    65.3  Barbara   F    98.0
4   14    63.5    Henry   M   102.5
6   12    59.8     Jane   F    84.5

In [32]:
dic2 = {'a':[1, 2, 3], 'b':[4, 5, 6], 'c':[7, 8, 9]}
df = pd.DataFrame(dic2, index=['1', '2', '3'])
df

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [33]:
df.index

Index(['1', '2', '3'], dtype='object')

In [34]:
df.loc['2']

a    2
b    5
c    8
Name: 2, dtype: int64

In [35]:
df.iloc[2]

a    3
b    6
c    9
Name: 3, dtype: int64

#### 查询指定的列
如果有多个列必须使用双重中括号

In [37]:
student.head()

   Age  Height     Name Sex  Weight
0   14    69.0   Alfred   M   112.5
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
3   14    62.8    Carol   F   102.5
4   14    63.5    Henry   M   102.5

In [39]:
student['Age'].head()

0    14
1    13
2    13
3    14
4    14
Name: Age, dtype: int64

In [40]:
student[['Age', 'Name']].head()

   Age     Name
0   14   Alfred
1   13    Alice
2   13  Barbara
3   14    Carol
4   14    Henry

#### 条件查询
#### 查询出所有12岁以上的女生信息

In [41]:
student[(student['Sex'] == 'F') & (student['Age'] > 12)]

    Age  Height     Name Sex  Weight
1    13    56.5    Alice   F    84.0
2    13    65.3  Barbara   F    98.0
3    14    62.8    Carol   F   102.5
7    15    62.5    Janet   F   112.5
11   14    64.3     Judy   F    90.0
13   15    66.5    Marry   F   112.0

#### 查询出所有12岁以上的女生姓名、身高和体重

In [43]:
student[(student['Sex'] == 'F') & (student['Age'] > 12)][['Name', 'Height', 'Weight']]

       Name  Height  Weight
1     Alice    56.5    84.0
2   Barbara    65.3    98.0
3     Carol    62.8   102.5
7     Janet    62.5   112.5
11     Judy    64.3    90.0
13    Marry    66.5   112.0

### 4. 利用pandas的DataFrames进行统计分析

In [44]:
np.random.seed(1234)
d1 = pd.Series(2 * np.random.normal(size=100) + 3)
d2 = np.random.f(2, 4, size=100)
d3 = np.random.randint(1, 100, size=100)

In [51]:
print('非空元素', d1.count())
print('最小值', d1.min())
print('最大值', d1.max())
print('最小值的位置', d1.idxmin())
print('最大值的位置', d1.idxmax())
print('10%分位数', d1.quantile(0.1))
print('求和', d1.sum())
print('均值', d1.mean())
print('中位数', d1.median())
print('众数', d1.mode())
print('方差', d1.var())
print('标准差', d1.std())
print('平均绝对偏值', d1.mad())
print('偏度', d1.skew())
print('峰度', d1.kurt())
print('描述性统计指标', d1.describe())

非空元素 100
最小值 -4.12703332125
最大值 7.78192103093
最小值的位置 81
最大值的位置 39
10%分位数 0.6870184644069928
求和 307.022456625
均值 3.07022456625
中位数 3.204555266776845
众数 0    -4.127033
1    -1.800907
2    -1.485370
3    -1.149955
4    -1.042510
5    -0.634054
6    -0.093811
7     0.108380
8     0.196053
9     0.618049
10    0.694682
11    0.714737
12    0.862022
13    0.944299
14    1.051527
15    1.147491
16    1.205686
17    1.429130
18    1.558823
19    1.688061
20    1.726953
21    1.830564
22    1.867108
23    1.903515
24    1.976237
25    2.061389
26    2.139809
27    2.200071
28    2.204320
29    2.310468
        ...
70    4.131477
71    4.263959
72    4.351108
73    4.408456
74    4.409441
75    4.510828
76    4.534737
77    4.633188
78    4.682018
79    4.683349
80    4.719177
81    4.727435
82    4.774326
83    4.906648
84    4.969840
85    4.983892
86    5.067601
87    5.091877
88    5.095157
89    5.117938
90    5.300071
91    5.636303
92    5.642211
93    5.642316
94    5.783972
95    5.865414
96    6.091318
97    7.015686
98    7.061207
99    7.781921
Length: 100, dtype: float64
方差 4.00560937854
标准差 2.00140185334
平均绝对偏值 1.51128804116
偏度 -0.649478076048
峰度 1.22010940524
描述性统计指标 count    100.000000
mean       3.070225
std        2.001402
min       -4.127033
25%        2.040101
50%        3.204555
75%        4.434788
max        7.781921
dtype: float64

In [52]:
## 相关系数
df.corr()

     a    b    c
a  1.0  1.0  1.0
b  1.0  1.0  1.0
c  1.0  1.0  1.0

In [53]:
## 协方差矩阵
df.cov()

     a    b    c
a  1.0  1.0  1.0
b  1.0  1.0  1.0
c  1.0  1.0  1.0

### 5.利用pandas实现SQL查询

In [54]:
dic = {'Name':['LiuShunxiang','Zhangshan'],'Sex':['M','F'],'Age':[27,23],'Height':[165.7,167.2],'Weight':[61,63]}
student2 = pd.DataFrame(dic)
student2

   Age  Height          Name Sex  Weight
0   27   165.7  LiuShunxiang   M      61
1   23   167.2     Zhangshan   F      63

In [55]:
### 将student2中的数据新增到student中
student3 = pd.concat([student, student2])
student3.head()

   Age  Height     Name Sex  Weight
0   14    69.0   Alfred   M   112.5
1   13    56.5    Alice   F    84.0
2   13    65.3  Barbara   F    98.0
3   14    62.8    Carol   F   102.5
4   14    63.5    Henry   M   102.5

In [57]:
## 删除指定的行
student.drop([0, 1, 3, 6]).head()

   Age  Height     Name Sex  Weight
2   13    65.3  Barbara   F    98.0
4   14    63.5    Henry   M   102.5
5   12    57.3    James   M    83.0
7   15    62.5    Janet   F   112.5
8   13    62.5  Jeffrey   M    84.0

#### 聚合操作 groupby

In [58]:
student.groupby('Sex').mean()

           Age     Height      Weight
Sex
F    13.222222  60.588889   90.111111
M    13.400000  63.910000  108.950000

In [59]:
student.groupby(['Sex', 'Age']).mean()

            Height  Weight
Sex Age
F   11   51.300000   50.50
    12   58.050000   80.75
    13   60.900000   91.00
    14   63.550000   96.25
    15   64.500000  112.25
M   11   57.500000   85.00
    12   60.366667  103.50
    13   62.500000   84.00
    14   66.250000  107.50
    15   66.750000  122.50
    16   72.000000  150.00

In [60]:
## 对每个分组计算多个统计值
student.drop('Age', axis=1).groupby('Sex').agg([np.mean, np.median])

        Height             Weight
          mean median        mean  median
Sex
F    60.588889  62.50   90.111111   90.00
M    63.910000  64.15  108.950000  107.25

#### 排序
sort_index, sort_values

In [61]:
data = pd.Series(np.array(np.random.randint(1, 20, 10)))
data

0    18
1    15
2    16
3    18
4    16
5     8
6    17
7    10
8    16
9     6
dtype: int64

In [64]:
data.sort_index()

0    18
1    15
2    16
3    18
4    16
5     8
6    17
7    10
8    16
9     6
dtype: int64

In [66]:
data.sort_values(ascending=False)

3    18
0    18
6    17
8    16
4    16
2    16
1    15
7    10
5     8
9     6
dtype: int64

In [69]:
student.sort_values(by=['Age', 'Height']).head()

    Age  Height    Name Sex  Weight
10   11    51.3   Joyce   F    50.5
17   11    57.5  Thomas   M    85.0
12   12    56.3  Louise   F    77.0
5    12    57.3   James   M    83.0
9    12    59.0    John   M    99.5

#### 多表连接
merge(on=连接字段，how=连接方式 left, right, outer)

In [70]:
dic2 = {'Name':['Alfred','Alice','Barbara','Carol','Henry','Jeffrey','Judy','Philip','Robert','Willam'],
        'Score':[88,76,89,67,79,90,92,86,73,77]}
score = pd.DataFrame(dic2)
score.head()

      Name  Score
0   Alfred     88
1    Alice     76
2  Barbara     89
3    Carol     67
4    Henry     79

In [72]:
stu_score1 = pd.merge(student, score, on='Name')
stu_score1.head()

   Age  Height     Name Sex  Weight  Score
0   14    69.0   Alfred   M   112.5     88
1   13    56.5    Alice   F    84.0     76
2   13    65.3  Barbara   F    98.0     89
3   14    62.8    Carol   F   102.5     67
4   14    63.5    Henry   M   102.5     79

In [73]:
pd.merge(student, score, on='Name', how='left').head()

   Age  Height     Name Sex  Weight  Score
0   14    69.0   Alfred   M   112.5   88.0
1   13    56.5    Alice   F    84.0   76.0
2   13    65.3  Barbara   F    98.0   89.0
3   14    62.8    Carol   F   102.5   67.0
4   14    63.5    Henry   M   102.5   79.0

### 6. 利用Pandas进行缺失值的处理
* 删除法 当数据中的某个变量大部分缺失时，可以考虑删除该变量；当缺失值是随机分布，且缺失的数量并不是很多时，也可以删除这些缺失的观测  
* 替补法 对于连续型变量，如果变量的分布近似或就是正态分布，可以用均值替代缺失值；如果变量是有偏的，可以使用中位数来代替缺失值；对于离散变量，一般用众数填充  
* 插补法 基于蒙特卡洛模拟法，结合线性模型、广义线性模型、决策树等方法计算出来的预测值替换缺失值

In [80]:
s = stu_score1['Score']
s

0    88
1    76
2    89
3    67
4    79
5    90
6    92
7    86
8    73
9    77
Name: Score, dtype: int64

In [81]:
print(sum(pd.isnull(s)))

0

In [82]:
s.dropna()

0    88
1    76
2    89
3    67
4    79
5    90
6    92
7    86
8    73
9    77
Name: Score, dtype: int64

#### 简单数值填充
* 用0填充所有缺失值  
* 采用前项填充或后项填充  
* 使用常量填充不同的列

In [84]:
### 用0填充
df.fillna(0)

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [85]:
df.fillna(method='ffill')

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [86]:
df.fillna(method='bfill')

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [87]:
df.fillna({'x1':1, 'x2':5})

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

### 7. 利用pandas实现Excel的数据透视表功能
```
pivot_table(data,values=None,
            index=None,
            columns=None,
            aggfunc='mean',
            fill_value=None,
            margins=False,
            dropna=True,
            margins_name='All')  
```

data：需要进行数据透视表操作的数据框  
values：指定需要聚合的字段  
index：指定某些原始变量作为行索引  
columns：指定哪些离散的分组变量  
aggfunc：指定相应的聚合函数  
fill_value：使用一个常数替代缺失值，默认不替换  
margins：是否进行行或列的汇总，默认不汇总  
dropna：默认所有观测为缺失的列  
margins_name：默认行汇总或列汇总的名称为'All'

In [88]:
Table1 = pd.pivot_table(student, values=['Height'], columns=['Sex'])
Table1

Sex             F      M
Height  60.588889  63.91

In [89]:
Table2 = pd.pivot_table(student, values=['Height', 'Weight'], columns=['Sex'])
Table2

Sex             F       M
Height  60.588889   63.91
Weight  90.111111  108.95

In [90]:
Table3 = pd.pivot_table(student, values=['Height', 'Weight'], columns=['Sex', 'Age'])
Table3

        Sex  Age
Height  F    11      51.300000
             12      58.050000
             13      60.900000
             14      63.550000
             15      64.500000
        M    11      57.500000
             12      60.366667
             13      62.500000
             14      66.250000
             15      66.750000
             16      72.000000
Weight  F    11      50.500000
             12      80.750000
             13      91.000000
             14      96.250000
             15     112.250000
        M    11      85.000000
             12     103.500000
             13      84.000000
             14     107.500000
             15     122.500000
             16     150.000000
dtype: float64

In [91]:
Table4 = pd.pivot_table(student, values=['Height', 'Weight'], columns=['Sex', 'Age']).unstack()
Table4

Age           11          12    13      14      15     16
       Sex
Height F    51.3   58.050000  60.9   63.55   64.50    NaN
       M    57.5   60.366667  62.5   66.25   66.75   72.0
Weight F    50.5   80.750000  91.0   96.25  112.25    NaN
       M    85.0  103.500000  84.0  107.50  122.50  150.0

In [94]:
## 使用多个聚合
Table5 = pd.pivot_table(student, values=['Height', 'Weight'], columns=['Sex', 'Age'], aggfunc=[np.mean, np.sum, np.std]).unstack()
Table5

            mean                                            sum                \
Age           11          12    13      14      15     16    11     12     13
       Sex
Height F    51.3   58.050000  60.9   63.55   64.50    NaN  51.3  116.1  121.8
       M    57.5   60.366667  62.5   66.25   66.75   72.0  57.5  181.1   62.5
Weight F    50.5   80.750000  91.0   96.25  112.25    NaN  50.5  161.5  182.0
       M    85.0  103.500000  84.0  107.50  122.50  150.0  85.0  310.5   84.0

                                std                                            \
Age            14     15     16  11         12        13        14         15
       Sex
Height F    127.1  129.0    NaN NaN   2.474874  6.222540  1.060660   2.828427
       M    132.5  133.5   72.0 NaN   3.932345       NaN  3.889087   0.353553
Weight F    192.5  224.5    NaN NaN   5.303301  9.899495  8.838835   0.353553
       M    215.0  245.0  150.0 NaN  22.765105       NaN  7.071068  14.849242


Age         16
       Sex
Height F   NaN
       M   NaN
Weight F   NaN
       M   NaN